SvenWesterhof/embedded-iot-platform/STM32/Bootloader/bootloader_main.c
/**
 * @file bootloader_main.c
 * @brief Minimal bootloader for STM32F767 dual-bank OTA
 *
 * Occupies Sectors 0-1 of Bank 1 (32KB at 0x08000000).
 * On reset:
 *   1. Checks RTC backup registers for "update pending" flag
 *   2. If pending: copies firmware from Bank 2 staging → Bank 1 app area
 *   3. Validates the app vector table
 *   4. Jumps to the application at 0x08008000
 *
 * Uses STM32 HAL for flash operations (proven, reliable).
 * USART3 printf for debug output (ST-Link VCP at 115200 baud).
 */

#include "stm32f7xx_hal.h"
#include <stdio.h>
#include <stdbool.h>

/* ========================================================================== */
/* Configuration                                                               */
/* ========================================================================== */

/**
 * IWDG watchdog configuration:
 * 
 * Set to 1 to enable production always-on IWDG watchdog:
 * - Bootloader starts IWDG (5s timeout) on EVERY boot
 * - Application MUST implement watchdog service to kick IWDG periodically
 * - Provides runtime hang detection and automatic recovery
 * - Requires application-side watchdog task implementation
 * 
 * Set to 0 to disable (current setting):
 * - No IWDG at all (simplest, for development)
 * - No application changes needed
 * 
 * NOTE: Currently disabled. Enable in future when adding full watchdog service.
 */
#define BOOTLOADER_IWDG_ALWAYS_ON   0   /* 0=disabled, 1=enabled */

/* ========================================================================== */
/* Constants                                                                   */
/* ========================================================================== */

#define APP_ADDRESS             0x08008000U   /* Application start (Sector 2) */
#define BANK2_BASE              0x08100000U   /* OTA staging area */
#define BANK1_APP_MAX_SIZE      0x000F8000U   /* 992KB (sectors 2-11) */

#define UPDATE_MAGIC            0xDEADBEEFU   /* RTC_BKP0R: update pending */
#define BOOT_CONFIRMED_MAGIC    0xB007C0DEU   /* RTC_BKP5R: app confirmed OK */

/* RTC Backup Register assignments */
#define BKP_UPDATE_FLAG         RTC->BKP0R    /* Magic value = update pending */
#define BKP_FW_SIZE             RTC->BKP1R    /* Firmware size in bytes */
#define BKP_FW_CRC              RTC->BKP2R    /* Expected CRC32 */
#define BKP_BOOT_ATTEMPTS       RTC->BKP3R    /* Boot attempt counter */
#define BKP_FW_VERSION          RTC->BKP4R    /* Packed version: (major<<16)|(minor<<8)|patch */
#define BKP_BOOT_CONFIRMED      RTC->BKP5R    /* App boot confirmation flag */
#define BKP_UPDATE_RETRIES      RTC->BKP6R    /* Update retry counter */

/* Boot attempt limits */
#define MAX_BOOT_ATTEMPTS       3             /* Max consecutive failed boots before rollback */
#define MAX_UPDATE_RETRIES      3             /* Max update retry attempts before giving up */

/* Dual-bank sector layout */
#define BANK1_FIRST_APP_SECTOR  2             /* First app sector (after bootloader) */
#define BANK1_LAST_SECTOR       11            /* Last sector in Bank 1 */
#define SECTORS_TO_ERASE        (BANK1_LAST_SECTOR - BANK1_FIRST_APP_SECTOR + 1)

/* Bootloader write protection — sectors 0-1 (Bank 1) */
#define BL_WRP_SECTORS          0x0003U       /* Bitmask: sector 0 and sector 1 */

/* BOOT_ADD0 values */
#define BOOT_ADDR_BANK1         0x2000U       /* 0x08000000 >> 14 */

/* ========================================================================== */
/* UART debug output                                                           */
/* ========================================================================== */

static UART_HandleTypeDef huart3_bl;

/* Raw UART output — works even when printf/newlib is broken */
static void bl_raw_putc(char c)
{
    while (!(USART3->ISR & USART_ISR_TXE)) {}
    USART3->TDR = (uint8_t)c;
}

static void bl_raw_puts(const char *s)
{
    for (; *s; s++) {
        if (*s == '\n') bl_raw_putc('\r');
        bl_raw_putc(*s);
    }
}

static void bl_raw_hex32(uint32_t val)
{
    static const char hex[] = "0123456789ABCDEF";
    bl_raw_puts("0x");
    for (int i = 28; i >= 0; i -= 4) {
        bl_raw_putc(hex[(val >> i) & 0xF]);
    }
}

static void bl_raw_flush(void)
{
    while (!(USART3->ISR & USART_ISR_TC)) {}
}

/* Print a labeled hex value: "  label = 0x12345678\r\n" */
static void bl_raw_print_reg(const char *label, uint32_t val)
{
    bl_raw_puts("  ");
    bl_raw_puts(label);
    bl_raw_puts(" = ");
    bl_raw_hex32(val);
    bl_raw_puts("\n");
}

static void bl_uart_init(void)
{
    __HAL_RCC_USART3_CLK_ENABLE();
    __HAL_RCC_GPIOD_CLK_ENABLE();

    /* USART3: PD8 (TX), PD9 (RX) — ST-Link VCP on Nucleo-F767ZI */
    GPIO_InitTypeDef gpio = {
        .Pin       = GPIO_PIN_8 | GPIO_PIN_9,
        .Mode      = GPIO_MODE_AF_PP,
        .Pull      = GPIO_NOPULL,
        .Speed     = GPIO_SPEED_FREQ_VERY_HIGH,
        .Alternate = GPIO_AF7_USART3,
    };
    HAL_GPIO_Init(GPIOD, &gpio);

    huart3_bl.Instance          = USART3;
    huart3_bl.Init.BaudRate     = 115200;
    huart3_bl.Init.WordLength   = UART_WORDLENGTH_8B;
    huart3_bl.Init.StopBits     = UART_STOPBITS_1;
    huart3_bl.Init.Parity       = UART_PARITY_NONE;
    huart3_bl.Init.Mode         = UART_MODE_TX_RX;
    huart3_bl.Init.HwFlowCtl    = UART_HWCONTROL_NONE;
    huart3_bl.Init.OverSampling = UART_OVERSAMPLING_16;
    HAL_UART_Init(&huart3_bl);
}

int __io_putchar(int ch)
{
    HAL_UART_Transmit(&huart3_bl, (uint8_t *)&ch, 1, HAL_MAX_DELAY);
    return ch;
}

/* ========================================================================== */
/* CRC32 (same algorithm as application — standard polynomial 0x04C11DB7)      */
/* ========================================================================== */

static uint32_t crc32_table[256];

static void crc32_init_table(void)
{
    for (uint32_t i = 0; i < 256; i++) {
        uint32_t crc = i;
        for (int j = 0; j < 8; j++) {
            if (crc & 1)
                crc = (crc >> 1) ^ 0xEDB88320U;
            else
                crc >>= 1;
        }
        crc32_table[i] = crc;
    }
}

static uint32_t crc32_compute(const uint8_t *data, uint32_t length)
{
    uint32_t crc = 0xFFFFFFFF;
    for (uint32_t i = 0; i < length; i++) {
        crc = crc32_table[(crc ^ data[i]) & 0xFF] ^ (crc >> 8);
    }
    return crc ^ 0xFFFFFFFF;
}

/* ========================================================================== */
/* IWDG watchdog (direct register access — no HAL driver needed)               */
/* ========================================================================== */

#define IWDG_KEY_ENABLE     0xCCCCU
#define IWDG_KEY_WRITE      0x5555U
#define IWDG_KEY_REFRESH    0xAAAAU

static void bl_iwdg_init(uint32_t timeout_ms)
{
    /* IWDG runs from LSI (~32 kHz)
     * Prescaler /64 → 500 Hz tick → 2ms per count
     * Max reload = 4095 → max ~8.19 seconds */
    uint32_t reload = timeout_ms / 2;
    if (reload > 4095) reload = 4095;

    /* 1. Enable LSI oscillator (required for IWDG) */
    RCC->CSR |= RCC_CSR_LSION;

    /* 2. Wait for LSI to be ready (with timeout) */
    uint32_t timeout = 100000;
    while (!(RCC->CSR & RCC_CSR_LSIRDY) && timeout--) {}
    if (timeout == 0) {
        printf("[BL] WARNING: LSI startup timeout, IWDG not started\n");
        return;
    }

