SvenWesterhof/embedded-iot-platform/STM32/Bootloader/bootloader_main.c
    /* 3. Enable write access to IWDG registers */
    IWDG->KR = IWDG_KEY_WRITE;

    /* 4. Configure prescaler and reload value */
    IWDG->PR = 4;                /* Prescaler /64 */
    IWDG->RLR = reload;

    /* 5. Wait for registers to update (with timeout) */
    timeout = 100000;
    while ((IWDG->SR & (IWDG_SR_PVU | IWDG_SR_RVU)) && timeout--) {}
    if (timeout == 0) {
        printf("[BL] WARNING: IWDG register update timeout\n");
    }

    /* 6. Start watchdog and refresh */
    IWDG->KR = IWDG_KEY_ENABLE;  /* Start watchdog */
    IWDG->KR = IWDG_KEY_REFRESH; /* Initial refresh */

    printf("[BL] IWDG started: timeout=%ums (reload=%u)\n", timeout_ms, reload);
}

static inline void bl_iwdg_kick(void)
{
    IWDG->KR = IWDG_KEY_REFRESH;
}

/* ========================================================================== */
/* Backup domain access                                                        */
/* ========================================================================== */

static void bl_enable_backup_domain(void)
{
    __HAL_RCC_PWR_CLK_ENABLE();
    HAL_PWR_EnableBkUpAccess();
    __HAL_RCC_RTC_ENABLE();
}

/* ========================================================================== */
/* BOOT_ADD0 enforcement                                                       */
/* ========================================================================== */

static void bl_ensure_boot_addr_bank1(void)
{
    FLASH_OBProgramInitTypeDef ob;
    HAL_FLASHEx_OBGetConfig(&ob);

    printf("[BL] Current OB: BOOT_ADD0=0x%04X, nDBANK=%u, USERConfig=0x%08X\n",
           (uint32_t)ob.BootAddr0,
           (ob.USERConfig & FLASH_OPTCR_nDBANK) ? 1U : 0U,
           (uint32_t)ob.USERConfig);

    bool needs_update = false;

    /* Ensure dual-bank mode (nDBANK=0) */
    if (ob.USERConfig & FLASH_OPTCR_nDBANK) {
        needs_update = true;
    }

    /* Ensure BOOT_ADD0 points to Bank 1 */
    if (ob.BootAddr0 != BOOT_ADDR_BANK1) {
        needs_update = true;
    }

    if (!needs_update) {
        printf("[BL] Option bytes are correct, no update needed\n");
        return;
    }

    printf("[BL] Fixing option bytes...\n");

    HAL_FLASH_Unlock();
    HAL_FLASH_OB_Unlock();

    /* Fix dual-bank mode if needed */
    if (ob.USERConfig & FLASH_OPTCR_nDBANK) {
        ob.OptionType = OPTIONBYTE_USER;
        ob.USERConfig &= ~FLASH_OPTCR_nDBANK;
        HAL_FLASHEx_OBProgram(&ob);
    }

    /* Fix BOOT_ADD0 if needed */
    if (ob.BootAddr0 != BOOT_ADDR_BANK1) {
        ob.OptionType = OPTIONBYTE_BOOTADDR_0;
        ob.BootAddr0  = BOOT_ADDR_BANK1;
        HAL_FLASHEx_OBProgram(&ob);
    }

    HAL_FLASH_OB_Lock();
    HAL_FLASH_Lock();

    printf("[BL] Option bytes updated, resetting...\n");
    HAL_FLASH_OB_Launch();
    NVIC_SystemReset();
    while (1) {}  /* Should not reach here */
}

/* ========================================================================== */
/* Bootloader write protection                                                 */
/* ========================================================================== */

static void bl_protect_bootloader_sectors(void)
{
    FLASH_OBProgramInitTypeDef ob;
    HAL_FLASHEx_OBGetConfig(&ob);

    /* Check if sectors 0-1 are already write-protected
     * WRPSector bitmask: bit=0 means protected, bit=1 means unprotected
     * We want bits 0-1 to be 0 (protected) */
    uint32_t current_wrp = ob.WRPSector;
    if ((current_wrp & BL_WRP_SECTORS) == 0) {
        printf("[BL] Sectors 0-1 already write-protected\n");
        return;
    }

    printf("[BL] Enabling write-protection for bootloader sectors 0-1...\n");

    HAL_FLASH_Unlock();
    HAL_FLASH_OB_Unlock();

    ob.OptionType = OPTIONBYTE_WRP;
    ob.WRPState   = OB_WRPSTATE_ENABLE;
    ob.WRPSector  = BL_WRP_SECTORS;

    HAL_StatusTypeDef status = HAL_FLASHEx_OBProgram(&ob);

    HAL_FLASH_OB_Lock();
    HAL_FLASH_Lock();

    if (status != HAL_OK) {
        printf("[BL] WARNING: Failed to set write protection (status %d)\n", status);
        return;
    }

    printf("[BL] Write protection set, launching OB reload...\n");
    HAL_FLASH_OB_Launch();
    /* OB_Launch may trigger a reset — that's expected */
}

/* ========================================================================== */
/* Boot attempt counter (anti-brick)                                           */
/* ========================================================================== */

static bool bl_check_boot_attempts(void)
{
    uint32_t attempts = BKP_BOOT_ATTEMPTS;
    uint32_t confirmed = BKP_BOOT_CONFIRMED;

    printf("[BL] Boot attempts: %u, confirmed: 0x%08X\n", attempts, confirmed);

    /* If the last boot was confirmed by the application, reset counter */
    if (confirmed == BOOT_CONFIRMED_MAGIC) {
        if (attempts > 0) {
            printf("[BL] Previous boot confirmed OK — resetting attempt counter\n");
            BKP_BOOT_ATTEMPTS = 0;
        }
        BKP_BOOT_CONFIRMED = 0;  /* Clear for next boot cycle */
        return true;
    }

    /* Application didn't confirm — increment attempt counter */
    attempts++;
    BKP_BOOT_ATTEMPTS = attempts;

    if (attempts >= MAX_BOOT_ATTEMPTS) {
        printf("[BL] WARNING: %u consecutive unconfirmed boots (max %d)\n",
               attempts, MAX_BOOT_ATTEMPTS);
        printf("[BL] Application may be faulty — boot will proceed but flag is set\n");
        return false;  /* Signal that we've exceeded max attempts */
    }

    printf("[BL] Boot attempt %u/%d\n", attempts, MAX_BOOT_ATTEMPTS);
    return true;
}

/* ========================================================================== */
/* Flash operations                                                            */
/* ========================================================================== */

static bool bl_erase_app_sectors(void)
{
    printf("[BL] Erasing Bank 1 sectors %d-%d...\n",
           BANK1_FIRST_APP_SECTOR, BANK1_LAST_SECTOR);

    HAL_FLASH_Unlock();

    FLASH_EraseInitTypeDef erase = {
        .TypeErase    = FLASH_TYPEERASE_SECTORS,
        .Banks        = FLASH_BANK_1,
        .Sector       = BANK1_FIRST_APP_SECTOR,
        .NbSectors    = SECTORS_TO_ERASE,
        .VoltageRange = FLASH_VOLTAGE_RANGE_3,
    };

    uint32_t error = 0;
    #if BOOTLOADER_IWDG_ALWAYS_ON
    bl_iwdg_kick();  /* Kick watchdog before long erase operation */
    #endif
    HAL_StatusTypeDef status = HAL_FLASHEx_Erase(&erase, &error);
    #if BOOTLOADER_IWDG_ALWAYS_ON
    bl_iwdg_kick();  /* Kick again after erase completes */
    #endif

    HAL_FLASH_Lock();

    if (status != HAL_OK) {
        printf("[BL] Erase FAILED at sector %u (HAL status %d)\n", error, status);
        return false;
    }

    printf("[BL] Erase complete\n");
    return true;
}

static bool bl_copy_firmware(uint32_t fw_size)
{
    printf("[BL] Copying %u bytes: 0x%08X -> 0x%08X\n",
           fw_size, (uint32_t)BANK2_BASE, (uint32_t)APP_ADDRESS);

