SvenWesterhof/embedded-iot-platform/STM32/Bootloader/bootloader_main.c
    HAL_FLASH_Unlock();

    const uint32_t *src = (const uint32_t *)BANK2_BASE;
    uint32_t dst_addr = APP_ADDRESS;
    uint32_t words = (fw_size + 3) / 4;  /* Round up to full words */

    for (uint32_t i = 0; i < words; i++) {
        HAL_StatusTypeDef status = HAL_FLASH_Program(
            FLASH_TYPEPROGRAM_WORD, dst_addr, src[i]);

        if (status != HAL_OK) {
            printf("[BL] Write FAILED at 0x%08X (HAL status %d)\n",
                   dst_addr, status);
            HAL_FLASH_Lock();
            return false;
        }

        dst_addr += 4;

        /* Kick watchdog every 4KB (1024 words) */
        if ((i & 0x3FF) == 0) {
            bl_iwdg_kick();
        }

        /* Progress every 64KB */
        if ((i & 0x3FFF) == 0 && i > 0) {
            uint32_t pct = (i * 4 * 100) / fw_size;
            printf("[BL] Copy progress: %u%%\n", pct);
        }
    }

    HAL_FLASH_Lock();
    printf("[BL] Copy complete\n");
    return true;
}

static bool bl_verify_crc(uint32_t fw_size, uint32_t expected_crc)
{
    printf("[BL] Verifying CRC32 over %u bytes at 0x%08X...\n",
           fw_size, (uint32_t)APP_ADDRESS);

    uint32_t computed = crc32_compute((const uint8_t *)APP_ADDRESS, fw_size);

    printf("[BL] CRC32: computed=0x%08X, expected=0x%08X\n",
           computed, expected_crc);

    return (computed == expected_crc);
}

/* ========================================================================== */
/* Firmware update from Bank 2 staging                                         */
/* ========================================================================== */

static bool bl_apply_update(void)
{
    uint32_t fw_size     = BKP_FW_SIZE;
    uint32_t expected_crc = BKP_FW_CRC;
    uint32_t retry_count = BKP_UPDATE_RETRIES;

    printf("[BL] Update pending: size=%u, CRC=0x%08X, retries=%u\n", 
           fw_size, expected_crc, retry_count);

    /* Validate size */
    if (fw_size == 0 || fw_size > BANK1_APP_MAX_SIZE) {
        printf("[BL] ERROR: invalid firmware size\n");
        return false;
    }

    /* CRITICAL: Verify staged firmware in Bank 2 BEFORE erasing Bank 1
     * This prevents bricking if:
     * - Staged firmware was corrupted during write
     * - Flash read from Bank 2 fails
     * - Metadata mismatch
     * If this check fails, Bank 1 (old app) remains intact */
    printf("[BL] Verifying staged firmware in Bank 2...\n");
    #if BOOTLOADER_IWDG_ALWAYS_ON
    bl_iwdg_kick();  /* CRC can take time on large firmware */
    #endif
    uint32_t staged_crc = crc32_compute((const uint8_t *)BANK2_BASE, fw_size);
    
    if (staged_crc != expected_crc) {
        printf("[BL] ERROR: Staged firmware CRC mismatch!\n");
        printf("[BL]   Expected: 0x%08X\n", expected_crc);
        printf("[BL]   Computed: 0x%08X\n", staged_crc);
        printf("[BL] Bank 1 (old firmware) NOT erased — system still bootable\n");
        /* Clear update flag - staged firmware is bad, don't retry */
        BKP_UPDATE_FLAG = 0x00000000;
        BKP_UPDATE_RETRIES = 0;
        return false;
    }
    printf("[BL] Staged firmware verified OK\n");

    /* NOW it's safe to erase Bank 1 — we know Bank 2 has valid firmware */
    bool erase_ok = bl_erase_app_sectors();
    bool copy_ok = false;
    bool verify_ok = false;

    if (erase_ok) {
        /* Copy from Bank 2 staging to Bank 1 application area */
        copy_ok = bl_copy_firmware(fw_size);
        
        if (copy_ok) {
            /* Verify CRC of the copied firmware */
            verify_ok = bl_verify_crc(fw_size, expected_crc);
            if (!verify_ok) {
                printf("[BL] ERROR: CRC mismatch after copy!\n");
            }
        }
    }

    /* Check if update succeeded */
    if (!erase_ok || !copy_ok || !verify_ok) {
        /* Update failed, but Bank 2 is valid - implement retry logic */
        retry_count++;
        BKP_UPDATE_RETRIES = retry_count;

        if (retry_count >= MAX_UPDATE_RETRIES) {
            printf("[BL] ERROR: Update failed after %u attempts, giving up\n", retry_count);
            /* Clear flags to stop retrying */
            BKP_UPDATE_FLAG = 0x00000000;
            BKP_UPDATE_RETRIES = 0;
            return false;
        } else {
            printf("[BL] Update failed (attempt %u/%d), will retry on next boot\n",
                   retry_count, MAX_UPDATE_RETRIES);
            printf("[BL] Bank 2 staging area still contains valid firmware\n");
            /* DON'T clear update flag - will retry next boot */
            return false;
        }
    }

    /* Success! Clear all update metadata */
    bl_enable_backup_domain();
    BKP_UPDATE_FLAG = 0x00000000;
    BKP_UPDATE_RETRIES = 0;       /* Reset retry counter */
    BKP_BOOT_ATTEMPTS = 0;        /* Reset attempt counter for new firmware */
    BKP_BOOT_CONFIRMED = 0;       /* New firmware must confirm itself */

    /* Log version from BKP4R if set by the application */
    uint32_t ver = BKP_FW_VERSION;
    if (ver != 0) {
        printf("[BL] New firmware version: v%u.%u.%u\n",
               (ver >> 16) & 0xFF, (ver >> 8) & 0xFF, ver & 0xFF);
    }

    printf("[BL] Update applied successfully\n");
    return true;
}

/* ========================================================================== */
/* Application validation and jump                                             */
/* ========================================================================== */

static bool bl_validate_app(void)
{
    uint32_t app_sp = *(volatile uint32_t *)APP_ADDRESS;
    uint32_t app_pc = *(volatile uint32_t *)(APP_ADDRESS + 4);

    printf("[BL] App vector table: SP=0x%08X, PC=0x%08X\n", app_sp, app_pc);

    /* SP must point to RAM (0x20000000 - 0x20080000) */
    if (app_sp < 0x20000000 || app_sp > 0x20080000) {
        printf("[BL] ERROR: Invalid SP (not in RAM)\n");
        return false;
    }

    /* Reset_Handler must point to app flash region */
    if (app_pc < APP_ADDRESS || app_pc >= (APP_ADDRESS + BANK1_APP_MAX_SIZE)) {
        printf("[BL] ERROR: Invalid Reset_Handler (not in app flash)\n");
        return false;
    }

