SvenWesterhof/embedded-iot-platform/STM32/Bootloader/bootloader_main.c
    return true;
}

static void bl_jump_to_app(void) __attribute__((noreturn));
static void bl_jump_to_app(void)
{
    printf("[BL] Jumping to application at 0x%08X\n\n", (uint32_t)APP_ADDRESS);

    /* Flush UART before jumping */
    HAL_Delay(10);

    /* Disable all interrupts */
    __disable_irq();

    /* Reset peripherals used by bootloader */
    HAL_UART_DeInit(&huart3_bl);
    HAL_RCC_DeInit();
    HAL_DeInit();

    /* Clear pending interrupts */
    for (int i = 0; i < 8; i++) {
        NVIC->ICER[i] = 0xFFFFFFFF;
        NVIC->ICPR[i] = 0xFFFFFFFF;
    }

    /* Set VTOR to application */
    SCB->VTOR = APP_ADDRESS;

    /* Load SP and PC from application vector table */
    uint32_t app_sp = *(volatile uint32_t *)APP_ADDRESS;
    uint32_t app_pc = *(volatile uint32_t *)(APP_ADDRESS + 4);

    /* Set MSP and jump */
    __set_MSP(app_sp);
    __DSB();
    __ISB();

    void (*app_entry)(void) = (void (*)(void))app_pc;
    app_entry();

    /* Should never reach here */
    while (1) {}
}

/* ========================================================================== */
/* Error handler — blink LED forever                                           */
/* ========================================================================== */

static void bl_error_blink(void)
{
    /* PF13 = external LED on the user's board */
    __HAL_RCC_GPIOF_CLK_ENABLE();
    GPIO_InitTypeDef gpio = {
        .Pin  = GPIO_PIN_13,
        .Mode = GPIO_MODE_OUTPUT_PP,
        .Pull = GPIO_NOPULL,
        .Speed = GPIO_SPEED_FREQ_LOW,
    };
    HAL_GPIO_Init(GPIOF, &gpio);

    printf("[BL] ERROR: Halted. Blinking LED.\n");
    while (1) {
        HAL_GPIO_TogglePin(GPIOF, GPIO_PIN_13);
        HAL_Delay(200);
    }
}

/* ========================================================================== */
/* Reset cause detection                                                       */
/* ========================================================================== */

static void bl_print_reset_cause(void)
{
    uint32_t csr = RCC->CSR;

    printf("[BL] Reset cause:");
    if (csr & RCC_CSR_LPWRRSTF)  printf(" LOW-POWER");
    if (csr & RCC_CSR_WWDGRSTF)  printf(" WWDG");
    if (csr & RCC_CSR_IWDGRSTF)  printf(" IWDG");
    if (csr & RCC_CSR_SFTRSTF)   printf(" SOFTWARE");
    if (csr & RCC_CSR_PORRSTF)   printf(" POWER-ON");
    if (csr & RCC_CSR_PINRSTF)   printf(" PIN-RESET");
    if (csr & RCC_CSR_BORRSTF)   printf(" BROWNOUT");
    printf("\n");

    /* Clear reset flags so next reset shows only the new cause */
    __HAL_RCC_CLEAR_RESET_FLAGS();
}

/* ========================================================================== */
/* HardFault diagnostic handler                                                */
/* ========================================================================== */

/**
 * Called from HardFault_Handler with the correct stack pointer.
 * Prints the stacked registers and fault status registers.
 */
void bl_hardfault_diagnostic(uint32_t *stack_frame)
{
    /* Re-init UART clocks directly — HAL state may be corrupted */
    __HAL_RCC_USART3_CLK_ENABLE();
    __HAL_RCC_GPIOD_CLK_ENABLE();

    /* ALL output uses raw UART — printf is NOT safe in a fault handler */
    bl_raw_puts("\n\n!!! HARD FAULT !!!\n");
    bl_raw_print_reg("PC ", stack_frame[6]);
    bl_raw_print_reg("LR ", stack_frame[5]);
    bl_raw_print_reg("R0 ", stack_frame[0]);
    bl_raw_print_reg("R1 ", stack_frame[1]);
    bl_raw_print_reg("R2 ", stack_frame[2]);
    bl_raw_print_reg("R3 ", stack_frame[3]);
    bl_raw_print_reg("R12", stack_frame[4]);
    bl_raw_print_reg("PSR", stack_frame[7]);
    bl_raw_print_reg("CFSR ", SCB->CFSR);
    bl_raw_print_reg("HFSR ", SCB->HFSR);
    bl_raw_print_reg("MMFAR", SCB->MMFAR);
    bl_raw_print_reg("BFAR ", SCB->BFAR);

    uint32_t cfsr = SCB->CFSR;
    uint32_t hfsr = SCB->HFSR;
    if (cfsr & 0x00FF)     bl_raw_puts("  -> MemManage fault\n");
    if (cfsr & 0xFF00)     bl_raw_puts("  -> BusFault\n");
    if (cfsr & 0xFFFF0000) bl_raw_puts("  -> UsageFault\n");
    if (hfsr & SCB_HFSR_FORCED_Msk) bl_raw_puts("  -> Forced (escalated)\n");

    bl_raw_puts("\nHalted.\n");
    bl_raw_flush();

    /* Hard loop — do NOT call bl_error_blink (needs HAL_Delay/SysTick) */
    while (1) {
        __NOP();
    }
}

/**
 * HardFault_Handler — naked function to extract the correct stack pointer
 * and pass it to the C diagnostic function.
 */
void HardFault_Handler(void) __attribute__((naked));
void HardFault_Handler(void)
{
    __asm volatile(
        "tst lr, #4            \n"   /* Check EXC_RETURN bit 2 */
        "ite eq                \n"
        "mrseq r0, msp         \n"   /* Using MSP */
        "mrsne r0, psp         \n"   /* Using PSP */
        "b bl_hardfault_diagnostic \n"
    );
}

/* ========================================================================== */
/* Main                                                                        */
/* ========================================================================== */

int main(void)
{
    /* Basic system init (HSI 16 MHz, no PLL) */
    HAL_Init();

    /* Init UART for debug output */
    bl_uart_init();

    /* Print reset cause and banner */
    bl_print_reset_cause();
    printf("\n=== STM32F767 Dual-Bank Bootloader v1.1 ===\n");
    printf("=== Production-hardened: IWDG + WRP + Boot Counter ===\n\n");

    /* Enable backup domain for RTC backup registers */
    printf("[BL] Enabling backup domain...\n");
    bl_enable_backup_domain();

    /* Ensure BOOT_ADD0 always points to Bank 1 (one-time check) */
    printf("[BL] Checking option bytes...\n");
    bl_ensure_boot_addr_bank1();

    /* Protect bootloader sectors from accidental writes (one-time) */
    bl_protect_bootloader_sectors();

    /* Initialize CRC table */
    crc32_init_table();

#if BOOTLOADER_IWDG_ALWAYS_ON
    /* ===================================================================
     * PRODUCTION MODE: Start IWDG on EVERY boot
     * - Timeout: 5 seconds (generous for application startup)
     * - Application MUST kick watchdog or it will reset
     * - Industry standard for unattended/field devices
     * =================================================================== */
    printf("[BL] Starting IWDG (always-on mode) - App must service it\n");
    bl_iwdg_init(5000);  /* 5 second timeout for application */
#endif

    /* Check boot attempt counter (anti-brick mechanism) */
    bool boot_healthy = bl_check_boot_attempts();

    /* Check for pending firmware update */
    uint32_t update_flag = BKP_UPDATE_FLAG;

