SvenWesterhof/embedded-iot-platform/STM32/Bootloader/bootloader_main.c
    if (update_flag == UPDATE_MAGIC) {
        printf("[BL] Firmware update pending — applying...\n");

        #if BOOTLOADER_IWDG_ALWAYS_ON
        bl_iwdg_kick();
        #endif

        if (!bl_apply_update()) {
            printf("[BL] Update FAILED\n");

            /* Clear the flag to avoid infinite retry loop */
            BKP_UPDATE_FLAG = 0x00000000;

            #if BOOTLOADER_IWDG_ALWAYS_ON
            bl_iwdg_kick();
            #endif

            /* If there's still a valid app, try to boot it anyway */
            if (bl_validate_app()) {
                printf("[BL] Old app may still be valid, attempting boot...\n");
                bl_jump_to_app();
            }

            /* No valid app — halt */
            bl_error_blink();
        }
    } else {
        printf("[BL] No update pending (flag=0x%08X)\n", update_flag);
#if BOOTLOADER_IWDG_ALWAYS_ON
        bl_iwdg_kick();  /* Kick before validation in always-on mode */
#endif
    }

    /* Report boot health status */
    if (!boot_healthy) {
        printf("[BL] WARNING: Max boot attempts reached — app may be faulty\n");
        printf("[BL] App must call hal_flash_confirm_boot() to clear this warning\n");
    }

    /* Validate application */
    if (!bl_validate_app()) {
        printf("[BL] No valid application found!\n");
        bl_error_blink();
    }

#if BOOTLOADER_IWDG_ALWAYS_ON
    /* Final kick before jumping to app (app will take over servicing) */
    bl_iwdg_kick();
    printf("[BL] IWDG running (5s timeout) - App must service it!\n\n");
#endif

    /* Jump to application */
    bl_jump_to_app();
}

/* Variables normally provided by system_stm32f7xx.c */
uint32_t SystemCoreClock = 16000000U;  /* HSI default */
const uint8_t AHBPrescTable[16] = {0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9};
const uint8_t APBPrescTable[8]  = {0, 0, 0, 0, 1, 2, 3, 4};

/* Override SystemInit — bootloader doesn't need full clock setup */
void SystemInit(void)
{
    /* Enable FPU (required by HAL even at HSI clock) */
    SCB->CPACR |= ((3UL << 10*2) | (3UL << 11*2));

    /* Use default HSI (16 MHz) — fast boot, no PLL config needed */
}

/* HAL_MspInit stub — required by HAL_Init() */
void HAL_MspInit(void)
{
    /* Bootloader doesn't need MSP init */
}

/* SysTick handler — required by HAL default timebase (no FreeRTOS in bootloader) */
void SysTick_Handler(void)
{
    HAL_IncTick();
}

/* Error_Handler stub — required by HAL timebase and other HAL code */
void Error_Handler(void)
{
    printf("[BL] Error_Handler called\n");
    bl_error_blink();
}
